CSI API ETABS v1
cPropPointSpring.SetPointSpringProp Method
 Creates a new named point spring property, or modifies an existing named point spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPointSpringProp(
	string Name,
	int SpringOption,
	ref double[] k,
	string CSys = "",
	string SoilProfile = "",
	string Footing = "",
	double Period = 0,
	int color = 0,
	string notes = "",
	string iGUID = ""
)
Function SetPointSpringProp (
	Name As String,
	SpringOption As Integer,
	ByRef k As Double(),
	Optional CSys As String = "",
	Optional SoilProfile As String = "",
	Optional Footing As String = "",
	Optional Period As Double = 0,
	Optional color As Integer = 0,
	Optional notes As String = "",
	Optional iGUID As String = ""
) As Integer
Dim instance As cPropPointSpring
Dim Name As String
Dim SpringOption As Integer
Dim k As Double()
Dim CSys As String
Dim SoilProfile As String
Dim Footing As String
Dim Period As Double
Dim color As Integer
Dim notes As String
Dim iGUID As String
Dim returnValue As Integer
returnValue = instance.SetPointSpringProp(Name,
	SpringOption, k, CSys, SoilProfile,
	Footing, Period, color, notes, iGUID)
int SetPointSpringProp(
	String^ Name,
	int SpringOption,
	array<double>^% k,
	String^ CSys = L"",
	String^ SoilProfile = L"",
	String^ Footing = L"",
	double Period = 0,
	int color = 0,
	String^ notes = L"",
	String^ iGUID = L""
)
abstract SetPointSpringProp :
        Name : string *
        SpringOption : int *
        k : float[] byref *
        ?CSys : string *
        ?SoilProfile : string *
        ?Footing : string *
        ?Period : float *
        ?color : int *
        ?notes : string *
        ?iGUID : string
(* Defaults:
        let _CSys = defaultArg CSys ""
        let _SoilProfile = defaultArg SoilProfile ""
        let _Footing = defaultArg Footing ""
        let _Period = defaultArg Period 0
        let _color = defaultArg color 0
        let _notes = defaultArg notes ""
        let _iGUID = defaultArg iGUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of the point spring property. If this is an existing property, that property is modified; otherwise, a new property is added.
SpringOption
Type: System.Int32
 The spring stiffness option, either 1 or 2:
User Specified / Link Properties
Based on Soil Profile and Footing Dimensions
k
Type: System.Double[]
 This is an array of six spring stiffness values:
Value(0) = U1 [F/L]
Value(1) = U2 [F/L]
Value(2) = U3 [F/L]
Value(3) = R1 [FL/rad]
Value(4) = R2 [FL/rad]
Value(5) = R3 [FL/rad]
 This argument only applies when SpringOption = 1
CSys (Optional)
Type: System.String
 The name of the coordinate system in which the property is defined. If this item not defined or left blank, the Global coordinate system is assumed.
 This argument only applies when SpringOption = 1
SoilProfile (Optional)
Type: System.String
 The name of an existing Soil Profile
 This argument only applies when SpringOption = 2
Footing (Optional)
Type: System.String
 The name of an existing Isolated Column Footing
 This argument only applies when SpringOption = 2
Period (Optional)
Type: System.Double
 The first-mode time period [sec]
 This argument only applies when SpringOption = 2
color (Optional)
Type: System.Int32
 The display color for the property specified as an integer
notes (Optional)
Type: System.String
 The notes, if any, assigned to the property
iGUID (Optional)
Type: System.String
 The GUID (global unique identifier), if any, assigned to the property
Return Value
Type: Int32
 Returns zero if the property is successfully set, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
   Dim k() as Double
   ReDim k(5)
   k(2) = 1
   ret = SapModel.PropPointSpring.SetPointSpringProp("mySpringProp1", 1, k)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropPointSpring Interface
ETABSv1 Namespace